####################################
# 16位多周期CPU Logsim仿真测试程序 #
# 任务：R型指令加、减、与、或运算  #
# 可用寄存器，t0,t1,t2,t3          #
# Sp：0x007f 运算结果0xfffc-0xffff #                      
# Rock 2015-12-18                  #
####################################

sub $t0,$t0,$t0 #set 0 #0003
lw $t1,0x7f($t0)#得到运算元1 # 417f
lw $t2,0x7e($t0)#得到运算元2 # 427e
add $t3,$t1,$t2 #计算加法    # 06c2
sw $t3,0xff($t0) #存放计算结果 # 53ff
sub $t3,$t1,$t2 #计算减法    # 06c3
sw $t3,0xfe($t0) #存放计算结果 # 53fe
and $t3,$t1,$t2 #计算与      #06c1
sw $t3,0xfd($t0) #存放计算结果 # 53fd
or $t3,$t1,$t2 #计算或  # 06c0
sw $t3,0xfc($t0) #存放计算结果 #53fc










